# Есть список имен:
# girls = ["Иветта", "Виолетта", "Кассандра", "Вирджиния", "Амелия",
# "Розамунда", "Янина"]

# Используя список girls, выведите на экран следующие списки:
# ["Виолетта", "Кассандра", "Вирджиния", "Амелия"]
# ["Вирджиния", "Амелия", "Розамунда", "Янина", "Беатриса"]
# ["Иветта", "Виолетта", "Вирджиния", "Амелия"]
# ["Кассандра", "Амелия", "Розамунда"]

girls = ["Иветта", "Виолетта", "Кассандра", "Вирджиния", "Амелия", "Розамунда",
         "Янина"]

# Список 1: ["Виолетта", "Кассандра", "Вирджиния", "Амелия"]
list1 = girls[1:5]
print(list1)

# Список 2: ["Вирджиния", "Амелия", "Розамунда", "Янина", "Беатриса"]
list2 = girls[3:] + ["Беатриса"]
print(list2)

# Список 3: ["Иветта", "Виолетта", "Вирджиния", "Амелия"]
list3 = girls[:2] + girls[3:5]
print(list3)

# Список 4: ["Кассандра", "Амелия", "Розамунда"]
list4 = girls[2:3] + girls[4:6]
print(list4)
